src/cf/InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИнициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СвязиКонтрагентКонтакт/Forms/ИсторияСвязейСКонтактами/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент", ВладелецКонтрагент);

	Если ЗначениеЗаполнено(ВладелецКонтрагент) Тогда
		
		УстановитьОтборыСвязей(Справочники.КонтактныеЛица.ПустаяСсылка());
		
		// Контекстное открытие формы с отбором по контакту
		Элементы.Контрагент.Видимость = Ложь;
		
		Список.Параметры.УстановитьЗначениеПараметра("ОсновноеКонтактноеЛицоКонтрагента",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицо"));
			
		Список.Параметры.УстановитьЗначениеПараметра("Подписант",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицоПодписант"));
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент", ВладелецКонтрагент);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"КонтактНедействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.КонтактныеЛица);
	Элементы.ФормаГруппаОсновные.Доступность = МожноРедактировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Контрагент" ИЛИ ИмяСобытия = "Запись_КонтактноеЛицо" Тогда
		ОбновитьСписок();
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "УстановкаРеквизитаВыполнена" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ТипЗнч(Элемент.ТекущиеДанные) = ТипЗнч(Неопределено) 
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") ИЛИ 
		НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Контакт) ИЛИ НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Контакт) Тогда
		
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить(Элемент.ТекущиеДанные);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контакт",
			МассивОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
			
		МассивОтбораКонтрагент = Новый Массив;
		МассивОтбораКонтрагент.Добавить(ВладелецКонтрагент);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контрагент",
			МассивОтбораКонтрагент, ВидСравненияКомпоновкиДанных.ВСписке);
		Возврат;
		
	КонецЕсли;
	
	УстановитьОтборыСвязей(Элементы.Список.ТекущиеДанные.Контакт);
	
	Элементы.СвязьКонтактКонтрагент.ТекущаяСтрока = 1;
	
	КонтактНедействителен = ЭтоНедействительныйКонтакт(Элементы.Список.ТекущиеДанные.Контакт);
	СвязьНедействительна = Элементы.Список.ТекущиеДанные.ИндексПиктограммы = 1 ИЛИ Элементы.Список.ТекущиеДанные.ИндексПиктограммы = 2;
	
	Элементы.ИспользоватьКакОсновной.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоОсновноеКонтактноеЛицо 
		И НЕ СвязьНедействительна И НЕ КонтактНедействителен;
		
	Элементы.ИспользоватьКакПодписанта.Доступность = Не Элементы.Список.ТекущиеДанные.ЭтоПодписант 
			И НЕ СвязьНедействительна И НЕ КонтактНедействителен;
			
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Элемент.ТекущиеДанные.Контакт);
	ПараметрыФормы.Вставить("ТекущийКонтрагент", ВладелецКонтрагент);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСвязиКонтактКонтрагент

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьКонтактКонтрагентВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИспользоватьКакОсновной(Команда)
	
	ИнициализироватьЗаписьРеквизитаВладельца("КонтактноеЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКакПодписанта(Команда)
	
	ИнициализироватьЗаписьРеквизитаВладельца("КонтактноеЛицоПодписант");
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущиеДанные) = ТипЗнч(Неопределено) 
		ИЛИ ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ",Элементы.Список.ТекущиеДанные.Контакт);
	ОткрытьФорму("Справочник.КонтактныеЛица.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНедействительных(Команда)
	
	Элементы.ПоказыватьНедействительных.Пометка = Не Элементы.ПоказыватьНедействительных.Пометка;
	Элементы.СписокКонтекстноеМенюПоказыватьНедействительных.Пометка = Не Элементы.СписокКонтекстноеМенюПоказыватьНедействительных.Пометка;
	Элементы.КонтактНедействителен.Видимость = Элементы.ПоказыватьНедействительных.Пометка;

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"КонтактНедействителен",
		Ложь,
		,
		,
		Не Элементы.ПоказыватьНедействительных.Пометка);
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.Список.ТекущаяСтрока;
	
	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.Список.ТекущиеДанные.Контрагент, 
		Элементы.Список.ТекущиеДанные.Контакт,
		-1,
		Элементы.ПоказыватьНедействительных.Пометка);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = СтрокаДоСмещения;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено ИЛИ Элементы.Список.ТекущаяСтрока = Неопределено
		ИЛИ Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДоСмещения = Элементы.Список.ТекущаяСтрока;

	ПорядокЭлементовИзменен = ИзменитьПорядокЗаписей(Элементы.Список.ТекущиеДанные.Контрагент, 
		Элементы.Список.ТекущиеДанные.Контакт,
		1,
		Элементы.ПоказыватьНедействительных.Пометка);
	
	Если НЕ ПорядокЭлементовИзменен Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = СтрокаДоСмещения;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьЗаписьРеквизитаВладельца(ИмяРеквизита)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		
		Или Элементы.Список.ТекущиеДанные = Неопределено
		
		Или (ИмяРеквизита = "КонтактноеЛицо"
			И Элементы.Список.ТекущиеДанные.ЭтоОсновноеКонтактноеЛицо)
		
		Или (ИмяРеквизита = "КонтактноеЛицоПодписант"
			И Элементы.Список.ТекущиеДанные.ЭтоПодписант)
			
	Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Если открыта форма контрагента, то изменение основного контактного лица выполняем в ней
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент",		ВладелецКонтрагент);
	СтруктураПараметров.Вставить("КонтактноеЛицо",	Элементы.Список.ТекущиеДанные.Контакт);
	СтруктураПараметров.Вставить("Реквизит", 		ИмяРеквизита);
	
	Оповестить("УстановкаКонтактногоЛица", СтруктураПараметров, ЭтотОбъект);
	
	// Обновим динамический список
	Если ЗначениеЗаполнено(ВладелецКонтрагент) Тогда
		
		СоответствиеПараметровСписка = Новый Соответствие;
		СоответствиеПараметровСписка.Вставить("КонтактноеЛицо",			"ОсновноеКонтактноеЛицоКонтрагента");
		СоответствиеПараметровСписка.Вставить("КонтактноеЛицоПодписант","Подписант");
		
		Список.Параметры.УстановитьЗначениеПараметра(СоответствиеПараметровСписка[ИмяРеквизита],
			СтруктураПараметров.КонтактноеЛицо);
		
	Иначе
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1. Недействительные связи выделяем серым
	// a)общий список
	// б)список со связями
	НовоеУсловноеОформлениеСписок = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформлениеСписок.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформлениеСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СвязьНедействительна");
	Отбор.ПравоеЗначение 	= Истина;
	
	НовоеУсловноеОформлениеИсторияСвязей = СвязьКонтактКонтрагент.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформлениеИсторияСвязей.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформлениеИсторияСвязей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СвязьНедействительна");
	Отбор.ПравоеЗначение 	= Истина;
	
	// 1. Недействительные контакты/контрагентов выделяем серым
	НовоеУсловноеОформлениеСписок = Список.КомпоновщикНастроек.ФиксированныеНастройки.УсловноеОформление.Элементы.Добавить();
	
	Оформление = НовоеУсловноеОформлениеСписок.Оформление.Элементы.Найти("ЦветТекста");
	Оформление.Значение 		= ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет;
	Оформление.Использование 	= Истина;
	
	Отбор = НовоеУсловноеОформлениеСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование 	= Истина;
	Отбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("КонтактНедействителен");	
	Отбор.ПравоеЗначение 	= Истина;
	

КонецПроцедуры

&НаСервере
Функция ИзменитьПорядокЗаписей(Контрагент, Контакт, Смещение, ВключатьНедействительные)
	
	ПорядокИзменен = Ложь;
	
	РегистрыСведений.СвязиКонтрагентКонтакт.ИзменитьПорядок(Контрагент, Контакт, Смещение, ПорядокИзменен,
		ВключатьНедействительные);
	
	Возврат ПорядокИзменен;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписок()
	
	Список.Параметры.УстановитьЗначениеПараметра("ОсновноеКонтактноеЛицоКонтрагента",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицо"));
			
	Список.Параметры.УстановитьЗначениеПараметра("Подписант",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецКонтрагент, "КонтактноеЛицоПодписант"));
			
	
КонецПроцедуры

&НаСервере
Функция ЭтоНедействительныйКонтакт(Контакт)
	
	КонтактНедействителен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контакт, "Недействителен");
	
	Если КонтактНедействителен = Неопределено Тогда
		КонтактНедействителен = Ложь;
	КонецЕсли;
	
	Возврат КонтактНедействителен;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборыСвязей(Контакт)
	
	МассивОтбораКонтрагент = Новый Массив;
	МассивОтбораКонтрагент.Добавить(ВладелецКонтрагент);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контрагент",
		МассивОтбораКонтрагент, ВидСравненияКомпоновкиДанных.ВСписке);
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Контакт);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СвязьКонтактКонтрагент, "Контакт",
		МассивОтбора, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#КонецОбласти
